#+SETUPFILE:   base-template.org
#+TITLE:       Algo & Prog avec R
#+SUBTITLE:     Université Nice Sophia Antipolis
#+AUTHOR:       A. Malapert et M. Pelleau
#+OPTIONS: H:4 num:nil toc:2
#+HTML_LINK_UP: 
#+HTML_LINK_HOME: 
** STARTED Occurences
   #+BEGIN_SRC R :results output
     x <- c(1,2,2,3,3,3,4,4,4,4)
     CheckOcc <- function(x, v, k) {
       if(k <= 0) {return(TRUE)}
       for(i in x) {
         if(i == v) {
           k <- k - 1
           if(k <= 0) {return(TRUE)}
         }
       }
       return(k <= 0)
     }


     CheckOcc <- function(x, v, k) {
       i <- 1 
       n <- length(x)
       while(k > 0 && i <= n) {
         if(x[i] == v) {
           k <- k - 1
         }
         i <- i + 1
       }
       return(k <= 0)
     }

     CheckOcc <- function(x, v, k) {
       length(which( x == v)) >= k
     }


     CheckOcc(x, 1, 1)
     CheckOcc(x, 1, 2)
     CheckOcc(x, 2, 2)
     CheckOcc(x, 5, 1)
     CheckOcc(x, 5, 0)


   #+END_SRC

   #+RESULTS:
   : [1] TRUE
   : [1] FALSE
   : [1] TRUE
   : [1] FALSE
   : [1] TRUE

** STARTED Le compte est bon !
http://www.apmep.fr/Le-compte-est-souvent-bon
http://www.dcode.fr/compte-est-bon

#+BEGIN_SRC R :results output :session cpt
    
  GenGame <- function(n=6) sample(append(rep(1:10, 2), 25*(1:4)), n, replace=FALSE) 
  jeu <- GenGame()
  GenGoal <- function() sample(100:999, 1)
  goal <- GenGoal()
  Combine <- function(x, y) {
    r <- c(x+y, x*y)
    if(x != y) {
      r <- append(r, abs(x-y))
    }
    if(x %% y == 0) {
      r <- append(r, x %/% y)
    } else if(y %% x == 0) {
      r <- append(r, y %/% x)
    }
    return(r)
  }

  ItAllAddsUp <- function(x, y) {
    stopifnot(is.numeric(x))
    n <- length(x)
    if(n > 1) {
      for(i in seq(n-1)) {
        for(j in seq(i+1, n)) {
          z <- Combine(x[i], x[j])
          if( any(z == y) ) {
            return(TRUE)
          }
          for( zi in z) {
            x1 <- append(x[-c(i, j)], zi)
            if( ItAllAddsUp(x1, y)) {
              return(TRUE)
            }
          }
        }
      }
    }
    return(FALSE)
  }

  print(goal)
  print(jeu)
  ##ItAllAddsUp(jeu, goal)
#+END_SRC

#+RESULTS:
: [1] 801
: [1]  9  1 25  3  2  4

*** Script de calcul des notes                                     :noexport:

#+BEGIN_SRC R :var exercices=exercices :var projets=projets :session grade


  ## Load activities from the website
  UnLink <-function(x) gsub("\\[\\[.*\\]\\[(.*)\\]\\]", '\\1', x)

  activities <- data.frame( 
    name = make.names(c(UnLink(c(exercices$Problème, projets$Activité)), "QCM")),
    SITE = c(exercices$SITE, projets$SITE, 12),
    SV = c(exercices$SV, projets$SV, 12)
  )

  ## Load grades from moodle
  file <- '~/downloads/UCAnCODE Notes-20200122_1207-comma_separated.csv'
  df <- read.csv(file, stringsAsFactors = FALSE, na.strings = c("-", "NA"), header = TRUE)

  ## Compute the final QCM grades
  ComputeGradeQCM <- function() {
      qcm <- grep('Test\\..*', colnames(df))
      rowSums(df[ , qcm], na.rm = TRUE) * 10 / length(qcm)
    }
  df$QCM <- ComputeGradeQCM()

  ## Finalize the activities table
  cols <-  sapply(activities$name, function(x) grep(x, colnames(df)))
  ind <- sapply(cols, function(x) length(x) == 1)

  activities <- data.frame(
    column = unlist(cols),
    activities[ind, ]
  )

  ## Change the project scales
  scale20 <- colnames(df)[activities$column][grep("Devoir.", colnames(df)[activities$column])]
  df[, scale20] <- 5 * df[, scale20]
#+END_SRC

#+RESULTS:
| 23 | ROULETTE                                         | 12 | 14 |
| 24 | ADDREV                                           | 12 | 14 |
| 25 | SABLE                                            | 16 | 18 |
| 27 | TRADN                                            | 20 | 20 |
|  7 | Graphisme.tortue                                 | 20 | 20 |
|  8 | Convertisseur.de.base..shiny.                    | 12 | 14 |
|  9 | Coefficient.de.Gini..shiny.                      | 12 | 14 |
| 10 | Estimation.de.la.moyenne..shiny.                 | 12 | 14 |
| 11 | Manipulation.de.polynômes                        | 20 | 20 |
| 12 | Estimation.d.aires.par.la.méthode.de.Monte.Carlo | 20 | 20 |
| 34 | QCM                                              | 12 | 12 |


#+BEGIN_SRC R :session grade

  id <- "Adresse.de.courriel"

  ComputeCC <- function(grades, coefs) {
    ComputeAverage <- function(x) {
      x[ is.na(x) ] <- 0
      x <- x * coefs / 100
      return(mean(head( sort(x, decreasing = TRUE), 3)))
    }
    round(apply( grades, 1, ComputeAverage), 1)
  }

  df$CC.SV <- ComputeCC(df[ , activities$column], activities$SV)
  df$CC.SITE <- ComputeCC(df[ , activities$column], activities$SITE)

  ComputeBB <- function(bugBounties) {
    scale <- c("☆☆☆☆☆" = 0, "★☆☆☆☆" = 0.25, "★★☆☆☆" = 0.25, "★★★☆☆" = 0.5, "★★★★☆" = 0.5, "★★★★★" = 1)
    GetScoreBB <- function(stars) {
      if(is.na(stars)) return(0)
      else return(scale[stars])
    }
    unname(sapply(bugBounties, GetScoreBB))
  }
  df$BB <- ComputeBB(df$Devoir.Bug.Bounty..Brut.)

  ComputeGrades <- function(df, id, cc, ct, bb = 'BB') {
    ind <- !is.na(df[ , ct])
    grades <- unname(df[ind, c(id, cc, ct, bb)])
    colnames(grades) <- c('id', 'CC', 'CT', 'BB')
    ## compute grades
    grades$NOTE <- pmax(grades$CT, 0.6 * grades$CC + 0.4 * grades$CT) + grades$BB 
    ## round grades to the upper quarter
    grades$NOTE <- ceiling(4 * grades$NOTE)/4
    return(grades)
  }
  ## ComputeFinalGrades <- function(grades) ceiling(4 * (0.6 * grades$CC + 0.4 * grades$CT))/4

   gradesSV <- ComputeGrades(df, id, 'CC.SV', "CT.SV..Brut.")
   gradesSITE <- ComputeGrades(df, id, 'CC.SITE', "CT.SITE..Brut.")
   
   gradesAll <- rbind(gradesSV, gradesSITE)
   write.csv(gradesAll, 'notes-R.csv', row.names = FALSE)

  PlotGrades <- function(grades) {
    require(ggplot2)
    require(ggthemes)
    require(gridExtra)
    p1 <- ggplot(grades, aes(x=NOTE)) + geom_histogram(binwidth=1) + theme_gdocs() + theme(text = element_text(size=30))
    p2 <- ggplot(grades, aes(x=CT)) + geom_histogram(binwidth=1) + theme_gdocs() + theme(text = element_text(size=30))
    p3 <- ggplot(grades, aes(x=CC)) + geom_histogram(binwidth=1) + theme_gdocs() + theme(text = element_text(size=30))
    grid.arrange(p1, p2, p3, nrow = 1)
  }
  p <- PlotGrades(gradesSV)
  ggsave('frequencies-R-SV.pdf', plot = p, device = "pdf", width = 40, height = 15) 

  p <- PlotGrades(gradesSITE)
  ggsave('frequencies-R-SITE.pdf', plot = p, device = "pdf", width = 40, height = 15) 

  SummaryGrades <- function(grades) {
   summary(grades[ , c('CC', 'CT', 'NOTE')])
  }

  sink('summary-R.txt')
  cat('########\n## SV\n')
  SummaryGrades(gradesSV)
  cat('########\n## SITE\n')
  SummaryGrades(gradesSITE)
  sink()
#+END_SRC

#+RESULTS:
